WSM_I85B71/CFD/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
gradPAMP1        gradPAMP1 [ 0 1 -2 0 0 0 0 ] ( 0.76203664 0 0 );     // pressure osci amp
gradPAMP2        gradPAMP2 [ 0 1 -2 0 0 0 0 ] ( 0.13440022 0 0 );     // pressure osci amp
gradPAMP3        gradPAMP3 [ 0 1 -2 0 0 0 0 ] ( -0.6400559 0 0 );     // pressure osci amp
gradPOSC        gradPOSC [ 0 1 -2 0 0 0 0 ]   ( 0.76203664  0 0 );  // pressure osci real value
//gradPAMP1        gradPAMP1 [ 0 1 -2 0 0 0 0 ] ( 0 0 0 );     // pressure osci amp
//gradPAMP2        gradPAMP2 [ 0 1 -2 0 0 0 0 ] ( 0 0 0 );     // pressure osci amp
//gradPOSC        gradPOSC [ 0 1 -2 0 0 0 0 ]   ( 0 0 0 );  // pressure osci real value
gradPMEAN       gradPMEAN [ 0 1 -2 0 0 0 0 ] ( 0 0 0 );  //mean pressure
oscpT           oscpT [ 0 0 0 0 0 0 0 ] 6.5;       // osci period
initTheta1       initTheta1 [ 0 0 0 0 0 0 0] -90;    //initial deg since osci pressure is programed with sin
initTheta2       initTheta2 [ 0 0 0 0 0 0 0] 24.8;
assy             assy [ 0 0 0 0 0 0 0] 0.714;
fixbeddepth     fixbeddepth [0 0 0 0 0 0 0 ] 0.00;
transportModel  Newtonian;
rhos            rhos [1 -3 0 0 0 0 0 ] 2650;
nu              nu [ 0 2 -1 0 0 0 0 ] 1.0e-06;
ds              ds [0 1 0 0 0 0 0 ] 0.00021;
ufr             ufr [ 0 1 -1 0 0 0 0 ] 0.5;

/*CrossPowerLawCoeffs
{
    nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
    nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
    m               m [ 0 0 1 0 0 0 0 ] 1;
    n               n [ 0 0 0 0 0 0 0 ] 1;
}*/

/*BirdCarreauCoeffs
{
    nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
    nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
    k               k [ 0 0 1 0 0 0 0 ] 0;
    n               n [ 0 0 0 0 0 0 0 ] 1;
}*/
// ************************************************************************* //
